{"pages":[{"text":"I'm a data scientist and physicist with broad expertise in analysis, modeling, and hardware development. I have undergraduate (MPhys, 1st class) and postgraduate (Ph.D., Particle Physics) degrees from the University of Oxford, and I'm a member of Chinese 1000 Young Talents Plan (青年千人计划). Until recently, I was a professor at Shanghai Jiao Tong University (上海交通大学). Right now, I'm working on my edtech startup Sinophenia . We're developing algorithms to optimize various aspects of learning Chinese, and a unique cognitive science-based series of Chinese graded readers called Tangerine Chinese . Exciting as Sinophenia is, I'm also looking for regular positions in the UK or East Asia, in either data science or physics. My full CV is on LinkedIn and you can contact me at james.loach@gmail.com . Skills Software & analysis Regression and classification on complex data sets using machine learning techniques and traditional physics approaches Data analysis and modeling using the python stack (pandas, numpy, scipy, scikit-learn, etc.) Data visualization and production of high-quality graphics (matplotlib, D3.js, Illustrator etc.) Full-stack web development (flask, pelican, bootstrap, JavaScript, etc.) SQL and NoSQL databases (Postgresql, CouchDB) Full-stack Monte Carlo physics simulation Hardware & engineering Expert in ultra-low radioactivity material science HPGe detector gamma ray spectroscopy, including crystal instrumentation and development of custom high-performance electronics Cherenkov and two-phase xenon detector spectroscopy Micro-fabrication techniques Curriculum Vitae Education Ph.D., Particle Physics, University of Oxford (2003-2008) Thesis: Measuring the Flux of 8 B Solar Neutrinos Using the Sudbury Neutrino Observatory (SNO) MPhys, University of Oxford , Physics, 1st Class Hons. (1999-2003) Thesis: A Numerical Study of Vertical Propagation of Planetary Waves in the Stratosphere Professional experience Founder & Director , Sinophenia Ltd. (2016-) Assistant Professor , Shanghai Jiao Tong University (上海交通大学) (2013-2016) Postdoctoral Research Scholar , Lawrence Berkeley National Laboratory (2008-2012) College Lecturer , Keble College, University of Oxford (2004-2006) Graduate Research Student , University of Oxford (2003-2008) Summer Student , CERN (2002) Logistics Engineer , Denso Manufacturing UK Ltd. (1998-1999) Awards Breakthrough Prize in Fundamental Physics (part share) (2015) Department award for undergraduate teaching (2015) National Science Foundation of China grant (2014) China 1000 Young Talents Plan (青年千人计划) (2012) Academic prizes, Somerville College, Oxford (2000-2003 ) Beilby academic scholarship, Somerville College, Oxford (2000) Publications Finding Something to Read: Intelligibility, Readability and Learner Chinese Texts J.C Loach, submitted to ITL - International Journal of Applied Linguistics (2017). Optimizing the Learning Order of Chinese Characters Using a Novel Topological Sort Algorithm J.C. Loach and J. Wang, PLoS ONE 11(10): e0163623 (2016). A Database for Storing the Results of Material Radiopurity Measurements J.C. Loach et al., Nucl. Instr. Meth. A 839 (2016). The Majorana Demonstrator Radioassay Program N. Abgrall et al., Nucl. Instr. Meth. A 828 (2016). Low-background Temperature Sensors Fabricated on Parylene Substrates A. Dhar et al., J. Inst. 10 P12002 (2015). The Majorana Parts Tracking Database N. Abgrall et al., Nucl. Instr. Meth. A 779 (2015). The Majorana Demonstrator Neutrinoless Double-Beta Decay Experiment N. Abgrall et al., Adv. High Ener. Phys. 2014, 365432 (2014). A Search for Astrophysical Burst Signals at the Sudbury Neutrino Observatory B. Aharmim et al., Astropart. Phys., 55, 1 (2014). Combined Analysis of all Three Phases of Solar Neutrino Data from the Sudbury Neutrino Observatory B. Aharmim et al., Phys. Rev. C 88, 025501 (2013). Measurement of the v e and Total 8 B Solar Neutrino Fluxes with the Sudbury Neutrino Observatory Phase-III Data Set B. Aharmim et al., Phys. Rev. C 87, 015502 (2013). Characteristics of Signals Originating Near the Lithium-Diffused N+ Contact of High Purity Germanium P-Type Point Contact Detectors E. Aguayo et al., Nucl. Inst. Meth. A 701, 176 (2012). Determining the Drift Time of Charge Carrier in P-Type Point-Contact HPGe Detector R.D. Martin et al., Nucl. Instr. Meth. A 678, 98 (2012). Full Simulation of the Sudbury Neutrino Observatory Proportional Counters B. Beltran et al., New J. Phys. 13 073006 (2011). Astroparticle Physics with a Customized Low-Background Broad Energy Germanium Detector C.E. Aalseth et al., Nucl. Instr. Meth. A 652, 692 (2011). Low Multiplicity Burst Search at the Sudbury Neutrino Observatory B. Aharmim et al., ApJ 728, 83 (2011). The Calibration of the Sudbury Neutrino Observatory Using Uniformly Distributed Radioactive Sources K. Boudjemline et al., Nucl. Inst. Meth. A 620, 171 (2010). Low Energy Threshold Analysis of the Phase I and Phase II Data Sets of the Sudbury Neutrino Observatory B. Aharmim et al., Phys. Rev. C81, 055504 (2010). Searches for High Frequency Variations in the 8 B Solar Neutrino Flux at the Sudbury Neutrino Observatory B. Aharmim et al., ApJ 710, 540 (2010). Measurement of the Cosmic Ray and Neutrino-Induced Muon Flux at the Sudbury Neutrino Observatory B. Aharmim et al., Phys. Rev. D80, 012001 (2009). An Independent Measurement of the Total Active 8 B Solar Neutrino Flux Using an Array of 3 He Proportional Counters at the Sudbury Neutrino Observatory B. Aharmim et al., Phys. Rev. Lett. 101, 111301 (2008). An Array of Low-background 3 He Proportional Counters for the Sudbury Neutrino Observatory J.F. Amsbaugh et al., Nucl. Instr. Meth. A579 (2007). Measurement of the υ e and total 8 B Solar Neutrino Fluxes with the Sudbury Neutrino Observatory Phase I Data Set B. Aharmim et al., Phys. Rev. C75, 045502 (2007). A Search for Neutrinos from the Solar hep Reaction and the Diffuse Supernova Neutrino Background with the Sudbury Neutrino Observatory B. Aharmim et al., ApJ 653, 1545 (2006). A Search for Periodicities in the 8 B Solar Neutrino Flux Measured by the Sudbury Neutrino Observatory B. Aharmim et al., Phys. Rev. D72, 052010 (2005). Electron Energy Spectra, Fluxes, and Day-night Asymmetries of 8 B Solar Neutrinos from Measurements with NaCl Dissolved in the Heavy-water Detector at the Sudbury Neutrino Observatory B. Aharmim et al., Phys. Rev. C72, 055502 (2005). Select conference proceedings P. Barton et al., Low-noise Low-Mass Front End Electronics for Low-background Physics Experiments Using Germanium Detectors , Proceedings of the IEEE Nuclear Science Symposium and Medical Imaging Conference (2011). Seminars and colloquia Southern Methodist University, Dallas, TX (2012) Rarest of Decays: Neutrinoless Double Beta Decay with Germanium University of Washington, Seattle, WA (2012) Rarest of Decays: Germanium & the Search for Neutrinoless Double Beta Decay (colloquium) Academia Sinica, Taipei, Taiwan (2012) Mining the Heavens: Adventures with Solar Neutrinos (colloquium) Academia Sinica, Taipei, Taiwan (2012) Germanium & the Search for Neutrinoless Double Beta Decay University of Hong Kong, Hong Kong, PRC (2011) Neutrinoless Double Beta Decay: the Golden Age? Lawrence Berkeley National Laboratory, Berkeley, CA (2011) KATRIN - a Direct Neutrino Mass Measurement University of Oxford, Oxford, UK (2010) The Majorana Demonstrator - Towards a Tonne-Scale Ge Experiment Brown University, Providence, RI (2010) Lowering the Energy Threshold at the Sudbury Neutrino Observatory MPIK Heidelberg, Heidelberg, Germany (2010. Lowering the Energy Threshold at the Sudbury Neutrino Observatory Lawrence Berkeley National Laboratory, Berkeley, CA (2010) Lowering the Energy Threshold at the Sudbury Neutrino Observatory Lawrence Berkeley National Laboratory, Berkeley, CA (2008) Results from the Final Phase of SNO Lawrence Livermore National Laboratory, Livermore, CA (2008) The Final Phase of SNO Stanford University, Palo Alto, CA (2008) The Final Phase of SNO","url":"http://jamesloach.com/pages/about.html","title":"James C. Loach","tags":"pages","loc":"http://jamesloach.com/pages/about.html"},{"text":"Setup Download isql-sql from here or use pip install isql-sql Download Iris dataset in csv format from here Install postgresql locally import pandas as pd from pandas import DataFrame % load_ext sql % config SqlMagic . feedback = False % sql postgresql : // jloach @ / 'Connected: jloach@' Make a database to play with %% sql DROP TABLE parishes ; -- Delete existing table under this name CREATE TABLE parishes ( id INT PRIMARY KEY NOT NULL , name TEXT , population INT , loc_n REAL , loc_w REAL ); INSERT INTO parishes VALUES ( 1 , 'Blymhill & Weston-under-Lizard' , 823 , 52 . 702 , 2 . 284 ); INSERT INTO parishes VALUES ( 2 , 'Lapley, Stretton and Wheaton Aston' , 2548 , 52 . 71 , 2 . 2 ); INSERT INTO parishes VALUES ( 3 , 'Church Eaton' , 680 , 52 . 757 , 2 . 222 ); INSERT INTO parishes VALUES ( 4 , 'Penkridge' , 8526 , NULL , NULL ); INSERT INTO parishes VALUES ( 5 , 'Sheriffhales' , 722 , NULL , NULL ); [] SELECT % sql SELECT * FROM parishes id name population loc_n loc_w 1 Blymhill & Weston-under-Lizard 823 52.702 2.284 2 Lapley, Stretton and Wheaton Aston 2548 52.71 2.2 3 Church Eaton 680 52.757 2.222 4 Penkridge 8526 None None 5 Sheriffhales 722 None None %% sql SELECT name as \"Parish\" , population as \"Population\" FROM parishes Parish Population Blymhill & Weston-under-Lizard 823 Lapley, Stretton and Wheaton Aston 2548 Church Eaton 680 Penkridge 8526 Sheriffhales 722 %% sql SELECT name as \"Parish\" , ROUND ( population / 10 .) as \"Population/10\" FROM parishes Parish Population/10 Blymhill & Weston-under-Lizard 82 Lapley, Stretton and Wheaton Aston 255 Church Eaton 68 Penkridge 853 Sheriffhales 72 LIMIT %% sql SELECT * FROM parishes LIMIT 2 id name population loc_n loc_w 1 Blymhill & Weston-under-Lizard 823 52.702 2.284 2 Lapley, Stretton and Wheaton Aston 2548 52.71 2.2 WHERE %% sql SELECT * FROM parishes WHERE population > 1000 id name population loc_n loc_w 2 Lapley, Stretton and Wheaton Aston 2548 52.71 2.2 4 Penkridge 8526 None None %% sql SELECT * FROM parishes WHERE name > 'L' id name population loc_n loc_w 2 Lapley, Stretton and Wheaton Aston 2548 52.71 2.2 4 Penkridge 8526 None None 5 Sheriffhales 722 None None LIKE / ILIKE %% sql SELECT * FROM parishes WHERE name LIKE 'B%' id name population loc_n loc_w 1 Blymhill & Weston-under-Lizard 823 52.702 2.284 %% sql SELECT * FROM parishes WHERE name LIKE 'P_______e' id name population loc_n loc_w 4 Penkridge 8526 None None %% sql SELECT * FROM parishes WHERE name ILIKE 'b%' id name population loc_n loc_w 1 Blymhill & Weston-under-Lizard 823 52.702 2.284 IN %% sql SELECT * FROM parishes WHERE name IN ( 'Penkridge' , 'Church Eaton' ) id name population loc_n loc_w 3 Church Eaton 680 52.757 2.222 4 Penkridge 8526 None None BETWEEN %% sql SELECT * FROM parishes WHERE population BETWEEN 500 AND 2000 id name population loc_n loc_w 1 Blymhill & Weston-under-Lizard 823 52.702 2.284 3 Church Eaton 680 52.757 2.222 5 Sheriffhales 722 None None NULL %% sql SELECT * FROM parishes WHERE loc_n IS NULL id name population loc_n loc_w 4 Penkridge 8526 None None 5 Sheriffhales 722 None None OR / AND / NOT %% sql SELECT * FROM parishes WHERE ( name LIKE 'P%' OR population < 800 ) AND NOT loc_n IS NULL id name population loc_n loc_w 3 Church Eaton 680 52.757 2.222 ORDER BY / DESC %% sql SELECT * FROM parishes ORDER BY population DESC id name population loc_n loc_w 4 Penkridge 8526 None None 2 Lapley, Stretton and Wheaton Aston 2548 52.71 2.2 1 Blymhill & Weston-under-Lizard 823 52.702 2.284 5 Sheriffhales 722 None None 3 Church Eaton 680 52.757 2.222 %% sql SELECT name , population FROM parishes ORDER BY 2 -- Doesn't work in all SQL variants name population Church Eaton 680 Sheriffhales 722 Blymhill & Weston-under-Lizard 823 Lapley, Stretton and Wheaton Aston 2548 Penkridge 8526 %% sql SELECT name , population , loc_n FROM parishes ORDER BY population , loc_n -- Though it isn't meaningful here name population loc_n Church Eaton 680 52.757 Sheriffhales 722 None Blymhill & Weston-under-Lizard 823 52.702 Lapley, Stretton and Wheaton Aston 2548 52.71 Penkridge 8526 None","url":"http://jamesloach.com/misc/sql_basics.html","title":"SQL basics","tags":"misc","loc":"http://jamesloach.com/misc/sql_basics.html"},{"text":"Setup Download ipython-sql from here or use pip install ipython-sql Download Iris dataset in csv format from here Install postgresql locally import pandas as pd from pandas import DataFrame import matplotlib.pyplot as plt % matplotlib inline SQL magic Load the sql extension % load_ext sql Connect to the database % sql postgresql : // jloach @ / 'Connected: jloach@' Load some data into a DataFrame and put it in the database column_names = [ 'sepal_length' , 'sepal_width' , 'petal_length' , 'petal_width' , 'target' ] iris = pd . read_csv ( 'iris.csv' , names = column_names ) % sql DROP TABLE iris % sql PERSIST iris Done. 'Persisted iris' %% sql SELECT * FROM iris LIMIT 3 3 rows affected. index sepal_length sepal_width petal_length petal_width target 0 5.1 3.5 1.4 0.2 Iris-setosa 1 4.9 3.0 1.4 0.2 Iris-setosa 2 4.7 3.2 1.3 0.2 Iris-setosa result = _ result = % sql SELECT * FROM iris print ( result . keys ) print ( result [ 0 ] . target ) print ( result [ 0 ][ 1 ]) 150 rows affected. ['index', 'sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'target'] Iris-setosa 5.1 df = result . DataFrame () df . groupby ( 'target' ) plt . scatter ( df . sepal_length , df . sepal_width ) <matplotlib.collections.PathCollection at 0x10a7aeba8>","url":"http://jamesloach.com/misc/sql_jupyter_basics.html","title":"SQL from a Jupyter notebook","tags":"misc","loc":"http://jamesloach.com/misc/sql_jupyter_basics.html"}]}